Tekla.Structures.Catalogs.BoltItem
The BoltItem class contains information about the bolts in the Tekla Structures bolt catalog.

Tekla.Structures.Catalogs.BoltItem.#ctor
Creates a new bolt item instance.

Tekla.Structures.Catalogs.BoltItem.Standard
The bolt item's grade.

Tekla.Structures.Catalogs.BoltItem.Type
The bolt item's type.

Tekla.Structures.Catalogs.BoltItem.Size
The bolt item's size.

Tekla.Structures.Catalogs.BoltItem.Lengths
The bolt item's length values.

Tekla.Structures.Catalogs.BoltItem.ExportBoltStandard(System.String@)
Exports the bolt item standard + needed bolt catalog items in *.bass-format to the to given file name.
If path is not given bolt standard + items are exported to model folder.
If filename is empty bolt standard name is used as filename.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
CatalogHandler catalogHandler = new CatalogHandler();
if (catalogHandler.GetConnectionStatus())
{
BoltItemEnumerator boltItemEnumerator = CatalogHandler.GetBoltItems();
while (boltItemEnumerator.MoveNext())
{
BoltItem boltItem = boltItemEnumerator.Current as BoltItem;
if (boltItem.Standard == "A325N")
{
boltItem.ExportBoltStandard(System.IO.Path.GetTempPath() + "\\" + boltItem.Standard);
Result = true;
break;
}
}
}
}
}
filename: The export file name of the bolt assembly.
Returns: True on success.